Repository: manu-180/taller_ceramica
Catalog: lib/l10n/app_*.arb
Languages: es, fr

source: Hello World!
es: ¡Hola Mundo!
fr: Bonjour le monde!

source: Error loading data
es: Error al cargar los datos
fr: Erreur lors du chargement des données

# welcomeFemale
source: Welcome to the {taller} workshop!
es: ¡Bienvenida al taller de {taller}!
fr: Bienvenue à l'atelier {taller}!

# welcomeMale
source: Welcome to the {taller} workshop!
es: ¡Bienvenido al taller de {taller}!
fr: Bienvenue à l'atelier {taller}!

# helloAnonymous
source: Hello and welcome to our ceramics workshop, a space where creativity blends with tradition to shape unique and vibrant pieces!
es: ¡Hola y bienvenido/a a nuestro taller de cerámica, un espacio donde la creatividad se mezcla con la tradición para dar forma a piezas únicas y llenas de vida!
fr: Bonjour et bienvenue dans notre atelier de céramique, un espace où la créativité se mêle à la tradition pour donner vie à des pièces uniques et vibrantes!

# helloFemale
source: Hello {firstName} and welcome to our ceramics workshop, a space where creativity blends with tradition to shape unique and vibrant pieces!
es: ¡Hola {firstName} y bienvenida a nuestro taller de cerámica, un espacio donde la creatividad se mezcla con la tradición para dar forma a piezas únicas y llenas de vida!
fr: Bonjour {firstName} et bienvenue dans notre atelier de céramique, un espace où la créativité se mêle à la tradition pour donner vie à des pièces uniques et vibrantes!

# helloMale
source: Hello {firstName} and welcome to our ceramics workshop, a space where creativity blends with tradition to shape unique and vibrant pieces!
es: ¡Hola {firstName} y bienvenido a nuestro taller de cerámica, un espacio donde la creatividad se mezcla con la tradición para dar forma a piezas únicas y llenas de vida!
fr: Bonjour {firstName} et bienvenue dans notre atelier de céramique, un espace où la créativité se mêle à la tradition pour donner vie à des pièces uniques et vibrantes!

# whatWeDo
source: What do we do?
es: ¿Qué hacemos?
fr: Que faisons-nous?

# workshopDescription
source: Here, in our workshop, we create everything from small decorative pieces to large works of art, all with a unique design.
es: Aquí, en nuestro taller, creamos desde pequeñas piezas decorativas hasta grandes obras de arte, todas con un diseño único.
fr: Ici, dans notre atelier, nous créons tout, des petites pièces décoratives aux grandes œuvres d'art, toutes avec un design unique.

# workshopClasses
source: We offer classes for all levels, from beginners to experts, where you can learn modeling, glazing, and firing techniques, exploring your own ideas and style.
es: Ofrecemos clases para todos los niveles, desde principiantes hasta expertos, donde podrás aprender las técnicas de modelado, esmaltado y cocción, explorando tus propias ideas y estilo.
fr: Nous proposons des cours pour tous les niveaux, des débutants aux experts, où vous pouvez apprendre les techniques de modelage, de glaçage et de cuisson, tout en explorant vos propres idées et styles.

# usersSectionDescription
source: In this section, you can view registered users, modify their credits, and delete them if necessary.
es: En esta sección podrás ver los usuarios registrados, modificar sus créditos y eliminarlos si es necesario.
fr: Dans cette section, vous pouvez voir les utilisateurs enregistrés, modifier leurs crédits et les supprimer si nécessaire.

source: Delete User
es: Eliminar Usuario
fr: Supprimer l'utilisateur

# confirmDeleteUser
source: Are you sure you want to delete this user?
es: ¿Estás seguro de que deseas eliminar a este usuario?
fr: Êtes-vous sûr de vouloir supprimer cet utilisateur?

source: Add Credits
es: Agregar Créditos
fr: Ajouter des crédits

# selectCreditsToAdd
source: Select how many credits you want to add:
es: Selecciona cuántos créditos quieres agregar:
fr: Sélectionnez combien de crédits vous voulez ajouter:

source: Remove Credits
es: Remover Créditos
fr: Retirer des crédits

# selectCreditsToRemove
source: Select how many credits you want to remove:
es: Selecciona cuántos créditos quieres remover:
fr: Sélectionnez combien de crédits vous voulez retirer:

# noScheduledClasses
source: {fullname} has no scheduled classes
es: {fullname} no tiene clases programadas
fr: {fullname} n'a pas de cours programmés

# scheduledClasses
source: {fullname} is attending the classes: {classes}
es: {fullname} asiste a las clases: {classes}
fr: {fullname} participe aux cours : {classes}

# userDeletedSuccess
source: User deleted successfully
es: Usuario eliminado exitosamente
fr: Utilisateur supprimé avec succès

source: Error adding credits
es: Error al agregar el crédito
fr: Erreur lors de l'ajout des crédits

# creditsAddedSuccess
source: Credits added successfully
es: Crédito agregado exitosamente
fr: Crédits ajoutés avec succès

source: Error removing credits
es: Error al remover el crédito
fr: Erreur lors du retrait des crédits

# creditsRemovedSuccess
source: Credits removed successfully
es: Crédito removido exitosamente
fr: Crédits retirés avec succès

source: Create new user
es: Crear nuevo usuario
fr: Créer un nouvel utilisateur

# singleCredit
source: ({credit} credit)
es: ({credit} crédito)
fr: ({credit} crédit)

# multipleCredits
source: ({credits} credits)
es: ({credits} créditos)
fr: ({credits} crédits)

# enterNewName
source: Enter your new name:
es: Ingresa tu nuevo nombre:
fr: Entrez votre nouveau nom:

# validNameError
source: Please enter a valid name.
es: Por favor, ingresa un nombre válido.
fr: Veuillez entrer un nom valide.

# nameAlreadyExists
source: This name already exists, please choose another.
es: Este nombre ya existe, elige otro.
fr: Ce nom existe déjà, veuillez en choisir un autre.

# nameUpdatedSuccess
source: Name updated successfully.
es: Nombre actualizado con éxito.
fr: Nom mis à jour avec succès.

# updateNameButton
source: Update name
es: Actualizar nombre
fr: Mettre à jour le nom

# storeNotAvailable
source: The store is not available.
es: La tienda no está disponible.
fr: La boutique n'est pas disponible.

source: No products available.
es: No hay productos disponibles.
fr: Aucun produit disponible.

# purchaseError
source: Error processing the purchase: {error}
es: Error al procesar la compra: {error}
fr: Erreur lors du traitement de l'achat : {error}

# purchaseSuccess
source: Purchase completed successfully.
es: Compra completada con éxito.
fr: Achat réussi.

# createUserTitle
source: Create your user and password:
es: Crea tu usuario y contraseña:
fr: Créez votre utilisateur et votre mot de passe:

source: Full Name
es: Nombre y apellido
fr: Nom complet

# email
source: Email Address
es: Correo Electrónico
fr: Adresse e-mail

# invalidEmail
source: The email address is invalid.
es: El correo electrónico es inválido.
fr: L'adresse e-mail est invalide.

source: Password
es: Contraseña
fr: Mot de passe

source: Confirm Password
es: Confirmar Contraseña
fr: Confirmez le mot de passe

# passwordMinLength
source: The password must be at least 6 characters long.
es: La contraseña debe tener al menos 6 caracteres.
fr: Le mot de passe doit contenir au moins 6 caractères.

# requiredFields
source: All fields are required.
es: Todos los campos son obligatorios.
fr: Tous les champs sont obligatoires.

# emailAlreadyRegistered
source: The email address is already registered. Use another one.
es: El correo electrónico ya está registrado. Usa otro.
fr: L'adresse e-mail est déjà enregistrée. Utilisez-en une autre.

# nameAlreadyRegistered
source: The full name already exists. Use a different one to avoid conflicts.
es: El nombre completo ya existe. Usa uno diferente para no generar conflictos.
fr: Le nom complet existe déjà. Utilisez un autre pour éviter les conflits.

# unexpectedError
source: An unexpected error occurred: {error}.
es: Ocurrió un error inesperado: {error}.
fr: Une erreur inattendue s'est produite : {error}.

source: Register
es: Registrar
fr: S'inscrire

# registrationSuccess
source: Successful registration!
es: ¡Registro exitoso!
fr: Inscription réussie!

# misClasesTitle
source: My Classes
es: Mis Clases
fr: Mes cours

# confirmCancelationTitle
source: Confirm cancellation
es: Confirmar cancelación
fr: Confirmer l'annulation

# confirmWaitlistCancelation
source: Do you want to cancel your place on the waitlist for the class on {day} at {time}?
es: ¿Deseas cancelar tu lugar en la lista de espera para la clase del {day} a las {time}?
fr: Voulez-vous annuler votre place sur la liste d'attente pour le cours du {day} à {time}?

# confirmCancelWithCredit
source: Do you want to cancel the class on {day} at {time}? A credit will be generated so you can recover it!
es: ¿Deseas cancelar la clase el {day} a las {time}? ¡Se generará un crédito para que puedas recuperarla!
fr: Voulez-vous annuler le cours du {day} à {time}? Un crédit sera généré pour que vous puissiez le récupérer!

# confirmCancelWithoutCredit
source: Do you want to cancel the class on {day} at {time}? Keep in mind that if you cancel less than 24 hours in advance, you will not be able to recover the class.
es: ¿Deseas cancelar la clase el {day} a las {time}? Ten en cuenta que si cancelas con menos de 24hs de anticipación no podrás recuperar la clase.
fr: Voulez-vous annuler le cours du {day} à {time}? Gardez à l'esprit que si vous annulez moins de 24 heures à l'avance, vous ne pourrez pas récupérer le cours.

# cancelButton
source: Cancel
es: Cancelar
fr: Annuler

# acceptButton
source: Accept
es: Aceptar
fr: Accepter

# cancelEnrollmentSuccess
source: You have canceled your enrollment in the class.
es: Has cancelado tu inscripción en la clase.
fr: Vous avez annulé votre inscription au cours.

# cancelWaitlistSuccess
source: You have canceled your place on the waitlist.
es: Has cancelado tu lugar en la lista de espera.
fr: Vous avez annulé votre place sur la liste d'attente.

# noClassesTitle
source: You are not enrolled in any class.
es: No estás inscripto en ninguna clase.
fr: Vous n'êtes inscrit à aucun cours.

# noClassesSubtitle
source: Enroll in classes to see them here.
es: Inscríbete en clases para verlas aquí.
fr: Inscrivez-vous à des cours pour les voir ici.

# viewAndCancelClassesInfo
source: In this section, you can view and cancel your classes, but be careful! If you cancel less than 24 hours in advance, you will not be able to recover the class.
fr: Dans cette section, vous pouvez voir et annuler vos cours, mais soyez prudent! Si vous annulez moins de 24 heures à l'avance, vous ne pourrez pas récupérer le cours.

# mustLoginToViewClasses
source: To see your classes, you must log in!
es: ¡Para ver tus clases debes iniciar sesión!
fr: Pour voir vos cours, vous devez vous connecter!

# waitlistPosition
source: Your waitlist position: {position}
es: Tu lugar en espera: {position}
fr: Votre position sur la liste d'attente : {position}

# classScheduleInfo
source: In this session, you can see the available schedules for ceramics classes. Book your spot now!
es: En esta sesión podrás ver los horarios disponibles para las clases de cerámica. ¡Reserva tu lugar ahora!
fr: Dans cette session, vous pouvez voir les horaires disponibles pour les cours de céramique. Réservez votre place dès maintenant!

# noStudents
source: No students are enrolled in this class.
es: No hay alumnos inscriptos a esta clase.
fr: Aucun étudiant n'est inscrit à ce cours.

# studentsInClass
source: The students enrolled in this class are: {students}.
es: Los alumnos de esta clase son: {students}.
fr: Les étudiants inscrits à ce cours sont : {students}.

# selectDate
source: Select a date
es: Seleccione una fecha
fr: Sélectionnez une date

source: Monday
es: lunes
fr: Lundi

source: Tuesday
es: martes
fr: Mardi

source: Wednesday
es: miércoles
fr: Mercredi

source: Thursday
es: jueves
fr: Jeudi

source: Friday
es: viernes
fr: Vendredi

source: Saturday
es: sábado
fr: Samedi

source: Sunday
es: domingo
fr: Dimanche
